rt/ws/security/src/test/java/org/apache/cxf/ws/security/wss4j/in_enc.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  Licensed to the Apache Software Foundation (ASF) under one
  or more contributor license agreements. See the NOTICE file
  distributed with this work for additional information
  regarding copyright ownership. The ASF licenses this file
  to you under the Apache License, Version 2.0 (the
  "License"); you may not use this file except in compliance
  with the License. You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing,
  software distributed under the License is distributed on an
  "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  KIND, either express or implied. See the License for the
  specific language governing permissions and limitations
  under the License.
-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Header>
<wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" />
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference><ds:X509IssuerSerial xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerName xmlns:ds="http://www.w3.org/2000/09/xmldsig#">CN=alias</ds:X509IssuerName>

<ds:X509SerialNumber xmlns:ds="http://www.w3.org/2000/09/xmldsig#">1137540018</ds:X509SerialNumber>
</ds:X509IssuerSerial></wsse:SecurityTokenReference>
</ds:KeyInfo>
<xenc:CipherData><xenc:CipherValue>6k7AAdAg54H1VbK16ceAy5sLrPfWiycdXrpFtu0uXsuQ+hnczMc9UKFIPRYXoNPWCS5Uu1t3TEQr
fMjXG2+AmuT+hgUNKk3L0AK7f4jjoFY0dmmNnn3eQ6NlvUWI38dO59nKjKdaXD+4GRWRcZBgvoxG
FP+Lf9iW/DGo7Y2095s=</xenc:CipherValue></xenc:CipherData>
<xenc:ReferenceList><xenc:DataReference URI="#EncDataId-13729475" /></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security></soap:Header><soap:Body><xenc:EncryptedData Id="EncDataId-13729475" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" /><xenc:CipherData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:CipherValue xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">Bxe4tmTTzuX948Gif/Dz3KJtPCnjD99tFexyVoozwVOBD2m8pkbUCNbWk9sdqv5EupfC4z4E9ww5
FdezLUHjLMdB0b2dEuswO09G5EaxMcNneWczk2fxSkRWS8hpXttHqKz/c2xKmgvSJHVvD4efeQKN
+QU8C0Ycym+EwR4D/1+Gvzbry/ZDwos6GHyY2VUtCtMRyyVIol3X4Rqwj6Vnn9WxN9AhJDDeyQQk
4Xrxcdg/UBnXVORRSarF88GoiUj9IU7agwLcvOSYxF+IDo+JgVvRiKercpNA1O2olU5brysITBd6
GsMcbh+87UFOwpJKdOI3xlY6ckov/BRTezCMovDt9ErvsXoG</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>